create_clock -name {clk_i} -period 31.25 [get_ports clk_i]
create_clock -name {clk_rx_i} -period 15.625 [get_ports clk_rx_i]
create_generated_clock -name {clk_64} -source [get_ports clk_i] -divide_by 19000 -multiply_by 46769 [get_nets clk_64]
set_false_path -through [get_nets {deserializer0/i_o_pre1[0] deserializer0/i_o_pre1[1] deserializer0/i_o_pre1[2] deserializer0/i_o_pre1[3] deserializer0/i_o_pre1[4] deserializer0/i_o_pre1[5] deserializer0/i_o_pre1[6] deserializer0/i_o_pre1[7] deserializer0/i_o_pre1[8] deserializer0/i_o_pre1[9] deserializer0/i_o_pre1[10] deserializer0/i_o_pre1[11] deserializer0/i_o_pre1[12] deserializer0/q_o_pre1[0] deserializer0/q_o_pre1[1] deserializer0/q_o_pre1[2] deserializer0/q_o_pre1[3] deserializer0/q_o_pre1[4] deserializer0/q_o_pre1[5] deserializer0/q_o_pre1[6] deserializer0/q_o_pre1[7] deserializer0/q_o_pre1[8] deserializer0/q_o_pre1[9] deserializer0/q_o_pre1[10] deserializer0/q_o_pre1[11] deserializer0/q_o_pre1[12] deserializer0/drdy_pre1 deserializer0/i_o_pre0[0] deserializer0/i_o_pre0[1] deserializer0/i_o_pre0[2] deserializer0/i_o_pre0[3] deserializer0/i_o_pre0[4] deserializer0/i_o_pre0[5] deserializer0/i_o_pre0[6] deserializer0/i_o_pre0[7] deserializer0/i_o_pre0[8] deserializer0/i_o_pre0[9] deserializer0/i_o_pre0[10] deserializer0/i_o_pre0[11] deserializer0/i_o_pre0[12] deserializer0/q_o_pre0[0] deserializer0/q_o_pre0[1] deserializer0/q_o_pre0[2] deserializer0/q_o_pre0[3] deserializer0/q_o_pre0[4] deserializer0/q_o_pre0[5] deserializer0/q_o_pre0[6] deserializer0/q_o_pre0[7] deserializer0/q_o_pre0[8] deserializer0/q_o_pre0[9] deserializer0/q_o_pre0[10] deserializer0/q_o_pre0[11] deserializer0/q_o_pre0[12] deserializer0/drdy_pre0}]
